CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
    char gprs_url[64] = {};
    strcat(gprs_url, host);
    strcat(gprs_url, url);

    char pin[4];
    itoa(_pin, pin, 10);

#ifdef QUECTEL
    uint8_t statuscode = 0;

    char http_headers[3][40] = {};
    strcat(http_headers[0], "X-PIN: ");
    strcat(http_headers[0], pin);

    strcat(http_headers[1], "X-Sensor: ");
    strcat(http_headers[1], SENSOR_PREFIX);
    strcat(http_headers[1], esp_chipid);
    strcat(http_headers[2], "Content-Type: application/json");

    QUECTEL_POST(gprs_url, http_headers, 3, data, strlen(data), statuscode);

    if (statuscode == 200 || statuscode == 201)
    {
        Serial.println("GSM: Data sent successfully");
        return true;
    }
    else
    {
        Serial.println("GSM: Data send failed with HTTP status: " + String(statuscode));
        return false;
    }

    // ToDo: close HTTP session/ PDP context
#else
    return false;
#endif
}

/*****************************************************************
 * send data to rest api with fallback                           *
 *****************************************************************/
/**
    @brief: Send data to the server with communication priority and fallback
    @param data : JSON payload to send
    @param _pin : pin number of the sensor as configured in the API
    @param host : host name of the server
    @param url : url path to send the data
    @return: true if data is sent successfully via any method, false otherwise
    @note: Respects CommunicationPriority order and attempts fallback method if primary fails
**/
bool sendData(const char *data, const int _pin, const char *host, const char *url)
{
    bool send_result = false;

    // Check if any communication method is available
    if (CommsManagerState.allCommsUnavailable)
    {
        Serial.println("SendData: All communication methods are unavailable - data will be stored for later transmission");
        return false;
    }

    // Use preferred communication method determined by CommsManager
    switch (CommsManagerState.preferredComm)
    {
    case CommsManagerState.PreferredComm::WIFI:
        if (DeviceConfig.useWiFi && CommsManagerState.wifiOnline)
        {
            Serial.println("SendData: Attempting WiFi (preferred)...");
            send_result = sendDataViaWiFi(data, _pin, host, url);

            if (send_result)
            {
                return true;
            }

            // WiFi failed, try GSM fallback
            CommsManagerState.wifiFailCount++;
            Serial.println("SendData: WiFi failed, attempting GSM fallback...");

            if (DeviceConfig.useGSM && CommsManagerState.gsmOnline)
            {
                send_result = sendDataViaGSM(data, _pin, host, url);
                if (send_result)
                {
                    CommsManagerState.wifiFailCount = 0; // Reset on success
                    return true;
                }
                CommsManagerState.gsmFailCount++;
            }
        }
        break;

    case CommsManagerState.PreferredComm::GSM:
        if (DeviceConfig.useGSM && CommsManagerState.gsmOnline)
        {
            Serial.println("SendData: Attempting GSM (preferred)...");
            send_result = sendDataViaGSM(data, _pin, host, url);

            if (send_result)
            {
                return true;
            }

            // GSM failed, try WiFi fallback
            CommsManagerState.gsmFailCount++;
            Serial.println("SendData: GSM failed, attempting WiFi fallback...");

            if (DeviceConfig.useWiFi && CommsManagerState.wifiOnline)
            {
                send_result = sendDataViaWiFi(data, _pin, host, url);
                if (send_result)
                {
                    CommsManagerState.gsmFailCount = 0; // Reset on success
                    return true;
                }
                CommsManagerState.wifiFailCount++;
            }
        }
        break;

    case CommsManagerState.PreferredComm::NONE:
        // No preferred comms available, attempt either if configured
        if (DeviceConfig.useWiFi && CommsManagerState.wifiOnline)
        {
            Serial.println("SendData: Attempting WiFi (no preferred)...");
            send_result = sendDataViaWiFi(data, _pin, host, url);
            if (send_result)
                return true;
            CommsManagerState.wifiFailCount++;
        }

        if (DeviceConfig.useGSM && CommsManagerState.gsmOnline)
        {
            Serial.println("SendData: Attempting GSM (no preferred)...");
            send_result = sendDataViaGSM(data, _pin, host, url);
            if (send_result)
                return true;
            CommsManagerState.gsmFailCount++;
        }
        break;
    }

    if (!send_result)
    {
        Serial.println("SendData: Data transmission failed via all available methods - will retry later");
    }

    return send_result;
}

void init_memory_loggers()
{
    // Initialize memory loggers
    JSON_PAYLOAD_LOGGER.name = "JSON";
    JSON_PAYLOAD_LOGGER.path = SENSORS_JSON_DATA_PATH;
    JSON_PAYLOAD_LOGGER.type = DATA_LOGGERS::JSON;

    CSV_PAYLOAD_LOGGER.name = "CSV";
    CSV_PAYLOAD_LOGGER.path = SENSORS_CSV_DATA_PATH;
    CSV_PAYLOAD_LOGGER.type = DATA_LOGGERS::CSV;
}

/// @brief Init directories for logging files
void init_SD_loggers()
{
    // Root directory
    createDir(SD, ROOT_DIR);

    if (current_year != 0 && current_month != 0)
    {
        char _year[4] = {};
        strcpy(CURRENT_SENSORS_DATA_DIR, ROOT_DIR);
        strcat(CURRENT_SENSORS_DATA_DIR, BASE_SENSORS_DATA_DIR);

        createDir(SD, CURRENT_SENSORS_DATA_DIR); // Create base sensor directory "/ESP_CHIP_ID/SENSORSDATA"

        itoa(current_year, _year, 10);
        strcat(CURRENT_SENSORS_DATA_DIR, "/");
        strcat(CURRENT_SENSORS_DATA_DIR, _year);

        createDir(SD, CURRENT_SENSORS_DATA_DIR); // Create year directory "/ESP_CHIP_ID/SENSORSDATA/2025"
    }

    else
    {
        Serial.println("Year or month not set");
        return;
    }

    memset(SENSORS_JSON_DATA_PATH, 0, sizeof(SENSORS_JSON_DATA_PATH));
    char month[3] = {};
    getMonthName(current_month, month);

    // Update sensors JSON data path
    strcpy(SENSORS_JSON_DATA_PATH, CURRENT_SENSORS_DATA_DIR);
    strcat(SENSORS_JSON_DATA_PATH, "/");
    strcat(SENSORS_JSON_DATA_PATH, month);
    strcat(SENSORS_JSON_DATA_PATH, ".txt");

    // Update sensors CSV data path
    strcpy(SENSORS_CSV_DATA_PATH, CURRENT_SENSORS_DATA_DIR);
    strcat(SENSORS_CSV_DATA_PATH, "/");
    strcat(SENSORS_CSV_DATA_PATH, month);
    strcat(SENSORS_CSV_DATA_PATH, ".csv");

    int _from = 0;
    int _to = 0;
    if (readLine(SD, SENSORS_CSV_DATA_PATH, _to, _from, true) != (String)csv_header)
    {
        appendFile(SD, SENSORS_CSV_DATA_PATH, csv_header);
    }

    // Init logger paths
    strcpy(SENSORS_FAILED_DATA_SEND_STORE_PATH, ROOT_DIR);
    strcat(SENSORS_FAILED_DATA_SEND_STORE_PATH, BASE_SENSORS_DATA_DIR);
    strcat(SENSORS_FAILED_DATA_SEND_STORE_PATH, "/");
    strcat(SENSORS_FAILED_DATA_SEND_STORE_PATH, SENSORS_FAILED_DATA_SEND_STORE_FILE);
    strcat(SENSORS_FAILED_DATA_SEND_STORE_PATH, "\0");

    // write files to SD
    // writeFile(SD, SENSORS_JSON_DATA_PATH, "");                   // create file if it does not exist
    // writeFile(SD, SENSORS_FAILED_DATA_SEND_STORE_PATH, ""); // create file if it does not exist

