CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
JsonDocument getCurrentSensorData()
{
    return current_sensor_data;
}

void captureGSMInfo()
{
    // ToDo: Reduce memory footprint by moving global gsm_info doc to  scoped local variable asyncwebserver
    gsm_info["Network Name"] = GSMRuntimeInfo.operator_name = getNetworkName();
    // gsm_info["Network Band"] = GSMRuntimeInfo.network_band = getNetworkBand();
    gsm_info["Signal Strength"] = GSMRuntimeInfo.signal_strength = getSignalStrength();
    strcpy(GSMRuntimeInfo.sim_ccid, SIM_CCID);
    gsm_info["SIM ICCID"] = GSMRuntimeInfo.sim_ccid;
    gsm_info["Model ID"] = GSMRuntimeInfo.model_id = getModelID();
    gsm_info["Firmware Version"] = GSMRuntimeInfo.firmware_version = getFirwmareVersion();
    gsm_info["IMEI"] = GSMRuntimeInfo.imei = getIMEI();
}

void configDeviceFromWiFiConn()
{

    captureWiFiInfo();

    if (!DeviceConfigState.timeSet)
    {
        // synchronise system clock over NTP
        configTime(0, 0, "pool.ntp.org", "time.nist.gov");
        time_t now = time(nullptr);
        RTC.setTime(now);
        initCalender(RTC.getYear(), RTC.getMonth() + 1);
        DeviceConfigState.timeSet = true;
    }
}

void captureWiFiInfo()
{
    wifi_info["SSID"] = WiFi.SSID();
    wifi_info["BSSID"] = WiFi.BSSIDstr();
    wifi_info["Signal Strength"] = WiFi.RSSI();
    wifi_info["IP Address"] = WiFi.localIP().toString();
}

/**
    @brief Initialize and configure GSM module
    @details This function handles GSM serial initialization, GSM module initialization,
             network registration with timeout, GPRS initialization, time fetching, and puts GSM to sleep.
    @return : void
**/
void initializeAndConfigGSM()
{
    DeviceConfigState.state = ConfigurationState::CONFIG_GSM;
    DeviceConfigState.gsmConnected = GSM_Serial_begin();

    if (!DeviceConfigState.gsmConnected)
        return;
    DeviceConfigState.gsmConnected = GSM_init();
    if (!DeviceConfigState.gsmConnected)
        return;

    // GSM initialization successful
    GSM_CONNECTED = true; // TODO: Refactor to remove global variable and use state struct instead

    bool network_registered = false;

    if (setNetworkMode(NetMode::AUTO))
    {
        network_registered = register_to_network();
    }
    else if (setNetworkMode(NetMode::_2G))
    {
        network_registered = register_to_network();
    }
    else if (setNetworkMode(NetMode::_4G))
    {
        network_registered = register_to_network();
    }
    else
    {
        if (!network_registered)
        {
            Serial.println("Failed to register to GSM network");
            return;
        }
    }

    // GPRS initialization
    DeviceConfigState.gsmInternetAvailable = GPRS_init();
    CommsManagerState.gsmOnline = DeviceConfigState.gsmInternetAvailable;
    CommsManagerState.allCommsUnavailable = !DeviceConfigState.gsmInternetAvailable;

    // Fetch network time and update RTC
    if (!DeviceConfigState.timeSet)
    {
        if (getNetworkTime(time_buff))
        {
            // Update RTC time and calendar
            Serial.println("GSM Network Time: " + String(time_buff));
            esp_datetime_tz = extractDateTime(String(time_buff));
            RTC.setTime(esp_datetime_tz.timestamp);
            initCalender(RTC.getYear(), RTC.getMonth() + 1);
            DeviceConfigState.timeSet = true;
        }
        else
        {
            Serial.println("Failed to fetch time from network");
        }
    }
    captureGSMInfo();
    GSM_sleep();
}

void loadInitialConfigs()
{

#if defined(POWER_SAVING_MODE)
    DeviceConfig.power_saving_mode = POWER_SAVING_MODE;
#endif
#if defined(GSM_APN)
    DeviceConfig.gsm_apn = GSM_APN;
#endif
#if defined(GSM_APN_PWD)
    DeviceConfig.gsm_apn_pwd = GSM_APN_PWD;
#endif
#if defined(WIFI_STA_SSID)
    DeviceConfig.wifi_sta_ssid = WIFI_STA_SSID;
#endif
#if defined(WIFI_STA_PWD)
    DeviceConfig.wifi_sta_pwd = WIFI_STA_PWD;
#endif
#if defined(SIM_PIN)
    DeviceConfig.sim_pin = SIM_PIN;
#endif

    if (gsm_capable)
        DeviceConfig.useGSM = use_gsm;

    DeviceConfig.useWiFi = use_wifi;

    if (!DeviceConfig.useWiFi && !DeviceConfig.useGSM)
        DeviceConfigState.configurationRequired = true;

    // if (DeviceConfig.power_saving_mode)
    //     {
    //         sampling_interval = 15 * 60 * 1000; // 15 minutes
    //         sending_intervall_ms = 60 * 60 * 1000; // 1 hour
    //     }
    // else
    //     {
    //         sampling_interval = 1 * 60 * 1000; // 1 minute
    //         sending_intervall_ms = 5 * 60 * 1000; // 5 minutes
    //     }
}

/**
 * @brief Ping a server to verify internet connectivity
 * @param server : Server address/hostname to ping
 * @param port : Port number (typically 80 for HTTP, 443 for HTTPS)
 * @param timeout_ms : Timeout in milliseconds
 * @return : true if ping successful, false otherwise
 * @note : This function simplistically checks connectivity by attempting a TCP connection
 */
bool pingServer(const char *server, uint16_t port, uint16_t timeout_ms)
{
    if (server == nullptr)
        return false;

    // Try WiFi if available
    if (DeviceConfig.useWiFi && DeviceConfigState.wifiConnected)
    {
        bool wifi_internet_access = wifiHasInternet(server, port, timeout_ms);
        if (wifi_internet_access)
        {
            return true;
        }
    }

    // Try GSM if WiFi failed and GSM is available
    if (DeviceConfig.useGSM && DeviceConfigState.gsmConnected && GPRS_CONNECTED)
    {
        bool ping_success = pingIP(server);

        if (ping_success)
            return true;
    }

    return false;
}

/**
 * @brief Check if any communication method has internet connectivity
 * @details Attempts to ping a known server to verify actual internet availability
 *          Updates DeviceConfigState.wifiOnline and gsmOnline flags
 * @return : true if any communication is available, false if all failed
 */
bool isConnectivityAvailable()
{
    const char *PING_SERVER = "8.8.8.8";
    const uint16_t PING_PORT = 53;
    const uint16_t PING_TIMEOUT = 5000;

    unsigned long now = millis();

    // Perform connectivity check at regular intervals (every 15 minutes) to avoid excessive pinging
    if (now - CommsManagerState.lastConnectivityCheck < 60000)
    {
        return !CommsManagerState.allCommsUnavailable;
    }

    CommsManagerState.lastConnectivityCheck = now;

